<?php
// +----------------------------------------------------------------------
// | Thinking [ 2016 - 09 - 23 16:47]
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: s_洋仔 <liuyang87075853@163.com>
// +----------------------------------------------------------------------
/**
微信常用的函数
 **/

/*
 * 系统非常规md5加密方法
 *@param string $str 要加密的字符串
 *@return string
 * */
function mpid_md5($str,$key=null){
    trace($str,'TplMsg2:','DEBUG',true);
    return ''===$str ? '' : md5(sha1($str).$key);
}