<?php
// +----------------------------------------------------------------------
// | Thinking [ 2016 - 09 - 22 15:03]
// +----------------------------------------------------------------------
// | Copyright (c) 2014-2015 http://tqtzx.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: s_洋仔 <liuyang87075853@163.com>
// +----------------------------------------------------------------------
return array(
    //模块名
    'name'=>'Mpbase',
    //别名
    'alias'=>'公众号',
    //版本号
    'version'=>'1.0.0',
    //是否显示在导航栏内?1是，0否，暂时无效，保留项
    'show_nav'=>1,
    //模块描述
    'summary'=>'基础设置模块，用于公众平台基础信息',
    //开发者
    'developer'=>'s_洋仔',
    //开发者网站
    'website'=>'www.dok.com',
    //前台入口，可用U函数
    'entry'=>'Mpbase/index/index',
    //后台入口
    'admin_entry'=>'Admin/Mpbase/index',
    //模块图标
    'icon'=>'cog',
    //是否允许卸载，核心模块请设置为0
    'can_uninstall'=>0

);